{
	"version": "https://jsonfeed.org/version/1",
	"title": "Frank McPherson",
	"home_page_url": "https://frankmcpherson.blog/",
	"feed_url": "https://frankmcpherson.blog/feed.json",
	"items": [
		
		{
			"id": "http://frankm.micro.blog/2018/06/30/long-form-writing.html",
	      	
			"title": "Long Form Writing and Trying Out Netlify",
			
			"content_html": "<p>Unlike most others here at micro.blog, I consider <a href=\"https://frankmcpherson.blog/\">my micro.blog</a> as my blog. The reason is that I distinguish blogs from long form writing and publishing on the Internet. For me, a blog post is 1 to 3 paragraphs and written in about 15 minutes or less.</p>\n\n<p>I blog to share a thought or something of interest to me, I write to formulate and share ideas.</p>\n\n<p>When I set up my micro.blog account and associated a personal blog domain to it, I decided that I would use my then current blog, <a href=\"http://writing.frankmcpherson.org\">Let’s Be Frank</a>, for long form writing. The “broad” push to HTTPS is going to make that a problem because that blog is managed using an app written by Dave Winer called <a href=\"http://1999.io\">1999.io</a>, and it has a lot of Javascript libraries that I don’t think he is every going to convert to HTTPS.</p>\n\n<p>So, stay there and maybe figure out how to convert to HTTPS or look somewhere else? I recently <a href=\"https://www.baty.net/2018/back-to-netlify/\">learned about Netlify from Jack Baty</a> and after checking out its web site, I determined it has much of what I was looking for: <a href=\"https://www.netlify.com/pricing/\">low price</a>, easy HTTPS implementation, and flexibility.</p>\n\n<p>Netlify does not provide a Content Management System, but it integrates with Github to provide continuous deployment, so you can use static site generators like Jekyll for publishing content. Since I have a little experience with Jekyll, I decided to try out Netlify by following <a href=\"https://www.netlify.com/blog/2015/10/28/a-step-by-step-guide-jekyll-3.0-on-netlify/\">their Jekyll tutorial</a> and it didn’t take me long to get a site up and available via HTTPS.</p>\n\n<p>The upside with the approach I have so far is that I can write and publish content from any device, particularly my iPad. All you really need to do is add a file in the proper naming format to the posts folder of your Github repository. I’ve cloned the repository to Working Copy on my iPad and found a Drafts action that will save a new item to Working Copy and insert the proper header informatation that Jekyll requires.</p>\n\n<p>Right now <a href=\"https://writing.frankmcpherson.net\">the new site</a> is very much a work in progress and there may be changes. Oh, and I am aware of the irony of me writing this post here but this is is where you know me and I am not a stickler to such self determined rules.</p>\n",
			"date_published": "2018-06-30T11:38:04-04:00",
			"url": "https://frankmcpherson.blog/2018/06/30/long-form-writing.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/26/got-my-invite.html",
	      	
			"content_html": "<p>Got my invite to <a href=\"https://www.blog.google/products/google-one/one-simple-way-get-more-out-google/\">Google One</a> today, which I’ve accepted although I am not sure of the point.</p>\n",
			"date_published": "2018-06-26T11:58:47-04:00",
			"url": "https://frankmcpherson.blog/2018/06/26/got-my-invite.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/25/the-bridge-freeway.html",
	      	
			"content_html": "<p>The bridge freeway oasis is unique to the Chicago area and is <a href=\"http://www.chicagotribune.com/news/ct-met-ohare-oasis-tollway-expansion-met-20180622-story.html#nws=true\">slowly being removed.</a></p>\n",
			"date_published": "2018-06-25T08:44:14-04:00",
			"url": "https://frankmcpherson.blog/2018/06/25/the-bridge-freeway.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/25/013706.html",
	      	
			"content_html": "<p><img src=\"http://frankmcpherson.blog/uploads/2018/a80a662dc8.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-06-24T21:37:06-04:00",
			"url": "https://frankmcpherson.blog/2018/06/24/013706.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/24/do-you-think.html",
	      	
			"content_html": "<p>Do you think of micro.blog as a blog or an alternative to Twitter?</p>\n",
			"date_published": "2018-06-24T15:07:29-04:00",
			"url": "https://frankmcpherson.blog/2018/06/24/do-you-think.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/21/greatness-is-neither.html",
	      	
			"content_html": "<p>Greatness is neither self determined nor self declared.</p>\n",
			"date_published": "2018-06-21T10:36:13-04:00",
			"url": "https://frankmcpherson.blog/2018/06/21/greatness-is-neither.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/20/ive-got-android.html",
	      	
			"content_html": "<p>I’ve got Android Messages for Web enabled and I found that it does work with Chrome on iOS, however I haven’t received notifications for new in-bound messages on iOS. You can also set up Messages for Web with multiple computers but only one can be active at a time. I have to admit, this seems to work pretty well and helps me get past a limitation with Pushbullet on iOS.</p>\n",
			"date_published": "2018-06-20T17:53:22-04:00",
			"url": "https://frankmcpherson.blog/2018/06/20/ive-got-android.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/20/if-we-cant.html",
	      	
			"content_html": "<p>If we can’t agree that there are things humans should not do to other humans, particularly to those who are vulnerable, then we have a problem and that is being exposed in the United States’ <a href=\"https://slate.com/news-and-politics/2018/06/how-the-trump-administration-is-defending-its-indefensible-child-separation-policy.html\">current practice of separating children from families</a>. From the time that Trump seriously started running for president we have seen a widening gulf between those who care about what we do to one another and those who do not.</p>\n",
			"date_published": "2018-06-20T09:20:40-04:00",
			"url": "https://frankmcpherson.blog/2018/06/20/if-we-cant.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/19/i-dont-get.html",
	      	
			"content_html": "<p>I don’t get the need for <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.podcasts\">Google Podcasts</a>. There is already a section for Podcasts in Google Play Music that I have been using and have subscriptions. Google Podcasts isn’t even smart enough to import my existing subscriptions.</p>\n\n<p>I don’t listen to many podcasts any more now that I don’t spend an hour a day in the car commuting to an office.  In fact, most of my recent podcast listening has been using Apple’s Podcast app on an iPad.</p>\n",
			"date_published": "2018-06-19T14:18:33-04:00",
			"url": "https://frankmcpherson.blog/2018/06/19/i-dont-get.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/19/i-am-curious.html",
	      	
			"content_html": "<p>I am curious to know whether <a href=\"https://www.zdnet.com/article/googles-android-messages-for-web-is-here-this-is-how-it-lets-you-text-from-pcs-macs\">the new web messenging feature of Android Messages</a> will work in a browser on an iPad. I’ve been using Pushbullet for this type of remote texting, and that works well from an Android tablet or Windows PC, but the iOS version of Pushbullet does not support SMS.</p>\n",
			"date_published": "2018-06-19T14:08:19-04:00",
			"url": "https://frankmcpherson.blog/2018/06/19/i-am-curious.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/16/ive-been-hanging.html",
	      	
			"content_html": "<p>I’ve been hanging out at the new Starbucks down the road from my house.</p>\n\n<p><img src=\"http://frankmcpherson.blog/uploads/2018/9069db1e4a.jpg\" width=\"600\" height=\"599\" /></p>\n",
			"date_published": "2018-06-16T17:00:09-04:00",
			"url": "https://frankmcpherson.blog/2018/06/16/ive-been-hanging.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/16/195922.html",
	      	
			"content_html": "<p>I think I know what happened. With previous posts I published from Ulysses I did not enable markdown in the publishing dialog and therefore the publisher converted the markdown to HTML so it appeared correct in Wordpress. In the previous post I enabled markdown, and since Wordpress was not configured to use markdown it did not render properly. So, to have enabled markdown in the writing settings of the WP-Admin console, which fixed the problem.</p>\n\n<p>In other words…. operator error! :)</p>\n",
			"date_published": "2018-06-16T15:59:22-04:00",
			"url": "https://frankmcpherson.blog/2018/06/16/195922.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/16/i-just-published.html",
	      	
			"content_html": "<p>I just published <a href=\"https://the-narthex.org/2018/06/16/daryl-madden-unlearn/\">a post on one of my Wordpress blogs</a> using Ulysses for iOS, which I have used to publish before, and for some reason the markdown for hyperlinks was not properly recognized. Does anyone know if something has changed with Wordpress?</p>\n",
			"date_published": "2018-06-16T15:37:11-04:00",
			"url": "https://frankmcpherson.blog/2018/06/16/i-just-published.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/15/140221.html",
	      	
			"content_html": "<p>It is really disappointing that Apple removed all handwriting recognition keyboards for iOS. I would really like to be able to use the Apple Pencil in all of apps, which I should be able to at least do with a HWR keyboard. It looks like MyScript Stack and Stylus were all removed from the store.</p>\n",
			"date_published": "2018-06-15T10:02:21-04:00",
			"url": "https://frankmcpherson.blog/2018/06/15/140221.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/13/the-overthrow-will.html",
	      	
			"title": "The Overthrow Will Not Be By Force.",
			
			"content_html": "<p>Too many people in the United States think our government will be overthrown by force when the reality is it is happening in just the opposite manner. The strong arguments against gun control in the U.S. is evidence of this, as the argument centers around needing to keep guns as protection against government oppression. The powers that be don’t need to take guns away, they just need us to keep arguing about them, which fossilizes idealogy and keeps attention away from what is really happening.</p>\n\n<p>The constitution enables authoritarianism when Congress and the Supreme Court do not function in their jobs as overseers of the Presidency. When Congress and the Supreme Court simply align with a president due to party affliation, you have a dictator in practice.</p>\n\n<p>Today the process nearly complete, and gerrymandering will seal the deal. Gerrymandering removes the one power citizens have, which is to vote. You don’t need to burn down the flag nor rip up the Constitution, all that is needed is idealogical compliance to what the Presidency wants.</p>\n",
			"date_published": "2018-06-13T11:01:33-04:00",
			"url": "https://frankmcpherson.blog/2018/06/13/the-overthrow-will.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/12/wwwcomputerworldcom-also-takes.html",
	      	
			"content_html": "<p><a href=\"https://www.computerworld.com/article/3278560/mobile-apps/ios-apps-on-mac.html\">www.computerworld.com</a> also takes note of the similarities, and differences, between Apple and Google’s approach to mobile and desktop convergence.</p>\n",
			"date_published": "2018-06-11T22:06:10-04:00",
			"url": "https://frankmcpherson.blog/2018/06/11/wwwcomputerworldcom-also-takes.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/11/it-strikes-me.html",
	      	
			"content_html": "<p>It strikes me that <a href=\"https://mondaynote.com/ios-macos-what-no-actually-means-90b9fb2c46c7\">Apple’s plans for running iOS apps on MacOS</a> looks very similar to Google’s running Android apps on ChromeOS. <a href=\"https://developer.android.com/topic/arc/input-compatibility\">Google is providing for mouse support in Android apps</a>, which makes me wonder why Apple couldn’t add mouse support to iOS on iPads? There isn’t sa technical reason, I suspect it’s all about preserving Macs, assuming lack of mouse support in iOS is strong impediment to using iOS for productivity work.</p>\n",
			"date_published": "2018-06-11T10:37:33-04:00",
			"url": "https://frankmcpherson.blog/2018/06/11/it-strikes-me.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/08/i-wish-there.html",
	      	
			"content_html": "<p>I wish there was such a thing as insertion point actions on my personal devices, here is what I mean. If I am adding a task in <a href=\"https://noteplan.co/\">Noteplan</a> on my iPad to call a friend, it would be really cool to just tap and hold, to get an Actions menu, from which I see an option that says “Add link to a contact.”  A link would be pasted at the current location of the cursor.</p>\n",
			"date_published": "2018-06-08T11:10:29-04:00",
			"url": "https://frankmcpherson.blog/2018/06/08/i-wish-there.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/07/project-oasis-looks.html",
	      	
			"content_html": "<p><a href=\"https://www.theverge.com/circuitbreaker/2018/6/5/17429662/google-project-oasis-terrarium-weather-conditions\">Project Oasis</a> looks cool. Thinking about trying it out.</p>\n",
			"date_published": "2018-06-07T18:30:23-04:00",
			"url": "https://frankmcpherson.blog/2018/06/07/project-oasis-looks.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/07/i-like-drafts.html",
	      	
			"content_html": "<p>I like Drafts, but I think the concept behind it is nonsensical. The idea of Drafts is that you use it to write and edit any text that you can then send to other apps, which also have the capability to write and edit text. So, you see “actions” in Drafts for entering tasks in apps like OmniFocus and Todoist, but why is that easier than just entering information in Microblog, OmniFocus and Todoist? It seems to me that people who use iOS for productivity are so enamored by the workflows they have created they don’t seem to realize the workflows are basically workarounds for deficiencies that existed in previous versions of iOS.</p>\n\n<p>I am finding the number of iOS apps that basically do the same thing insane! Really, how many markdown editors are needed?</p>\n",
			"date_published": "2018-06-07T10:33:00-04:00",
			"url": "https://frankmcpherson.blog/2018/06/07/i-like-drafts.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/06/i-havent-seen.html",
	      	
			"content_html": "<p>I haven’t seen much written about this, but <a href=\"https://developer.apple.com/videos/play/wwdc2018/211/\">it looks to me like Siri Shortcuts is the new Workflow</a>. Will Workflow as we now know it go away to be replaced by the Siri Shortcuts app? It’s ironic that Apple aquired an app, Workflow, to make another app it aquired, Siri, more useful.</p>\n",
			"date_published": "2018-06-06T16:20:25-04:00",
			"url": "https://frankmcpherson.blog/2018/06/06/i-havent-seen.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/06/the-pad-quill.html",
	      	
			"content_html": "<p><a href=\"https://realpersonalcomputing.com/2018/06/06/the-pad-quill-ipad-pro-105-oxford-case/\">The Pad and Quill iPad Pro 10.5 Oxford Case</a></p>\n\n<p>I’ve written and published my first blog post with images entirely on my iPad.</p>\n",
			"date_published": "2018-06-06T13:27:54-04:00",
			"url": "https://frankmcpherson.blog/2018/06/06/the-pad-quill.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/06/i-want-ios.html",
	      	
			"content_html": "<p>I want iOS Do Not Disturb while I am using the Kindle app. I should be able to create this capability using Workflow, but Apple doesn’t let third party apps tinker with such settings.</p>\n",
			"date_published": "2018-06-06T12:50:08-04:00",
			"url": "https://frankmcpherson.blog/2018/06/06/i-want-ios.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/04/it-appears-as.html",
	      	
			"content_html": "<p>It appears as though everyone that I follow is at WWDC</p>\n",
			"date_published": "2018-06-04T14:32:09-04:00",
			"url": "https://frankmcpherson.blog/2018/06/04/it-appears-as.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/06/04/gradually-the-sun.html",
	      	
			"content_html": "<p>Gradually, the sun sets</p>\n\n<p><img src=\"http://frankmcpherson.blog/uploads/2018/efffcef8e9.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-06-03T22:11:05-04:00",
			"url": "https://frankmcpherson.blog/2018/06/03/gradually-the-sun.html"
		}
		
	]
}
