{
	"version": "https://jsonfeed.org/version/1",
	"title": "Frank McPherson's Web Notes",
	"icon": "https://micro.blog/frankm/avatar.jpg",
	"home_page_url": "https://frankmcpherson.blog/",
	"feed_url": "https://frankmcpherson.blog/feed.json",
	"items": [
		
		{
			"id": "http://frankm.micro.blog/2018/10/05/the-fact-that.html",
	      	
			"content_html": "<p>The fact that Kavanaugh will obviously not be “impartial” as an umpire is not surprising and not the real problem. The real problem is that the people supporting Kavanaugh do not want him to be impartial, they want and fully expect him to make decisions along their party ideaological lines.</p>\n\n<p>The root cause of this? <a href=\"https://www.salon.com/2014/12/24/my_horrible_right_wing_past_confessions_of_a_one_time_religious_right_icon/\">White Christian America</a>.</p>\n",
			"date_published": "2018-10-05T09:07:26-04:00",
			"url": "https://frankmcpherson.blog/2018/10/05/the-fact-that.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/04/theo-epstein-on.html",
	      	
			"content_html": "<p><a href=\"https://www.mlbtraderumors.com/2018/10/cubs-notes-maddon-offense-hamels-bullpen-bryant.html\">Theo Epstein on the Cub’s hitters</a>:</p>\n<blockquote>\n  <p>It’s probably time to stop evaluating this in terms of talent and start evaluating it in terms of production</p>\n</blockquote>\n\n<p>Yes, exactly! Looking forward on the conclusions and actions taken as a result of such an evaluation.</p>\n",
			"date_published": "2018-10-04T10:14:39-04:00",
			"url": "https://frankmcpherson.blog/2018/10/04/theo-epstein-on.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/04/ben-thompson-this.html",
	      	
			"content_html": "<p><a href=\"https://stratechery.com/2018/data-factories/\">Ben Thompson</a>:</p>\n<blockquote>\n  <p>This gets at how it is privacy regulations in particular go wrong: in the attempt to make rules that protect people without their agency, those wishing to take said agency cannot even know what exactly Facebook knows about them because, well, privacy. Meanwhile, websites throw up pop-ups and overlays that no one reads, or ban entire continents, not because their users care but because a regulator said so.</p>\n</blockquote>\n",
			"date_published": "2018-10-04T10:06:57-04:00",
			"url": "https://frankmcpherson.blog/2018/10/04/ben-thompson-this.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/04/love-notes-to.html",
	      	
			"content_html": "<p><a href=\"http://lovenotestonewton.moosefuel.media/\">Love Notes to Newton – A film about a little green computer and the people who love it.</a></p>\n\n<p>I need to make time to watch this documentary.</p>\n",
			"date_published": "2018-10-03T22:00:11-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/love-notes-to.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/03/civics-lesson.html",
	      	
			"title": "Civics Lesson",
			
			"content_html": "<p>First, one needs to learn what history says it means to be an American. Next, one needs to decide what they believe it means to be an American. How consistent are your beliefs with history?</p>\n<p>\n  Next, one needs to determine what each political party claims it stands for and challenge the assumptions for how those claims are consistent with being an American and for progress. \n  <br />\n</p>\n<p>\n  Of course, the questions of whether progress is needed, desired, and how it looks needs to be decided, ultimately by each individual. \n  <br />\n</p>\n",
			"date_published": "2018-10-03T11:23:18-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/civics-lesson.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/03/from-the-republicans.html",
	      	
			"content_html": "<p>From the Republican’s point of view, the credibility of the Supreme Court and the sanctity of the Constitution is not what is at stake. What is at stake is putting in permanent place Supreme Court justices that support only their ideology.</p>\n\n<p>The simple problem we have is that nobody in positions of Power in this country, be they elected officials, corporations, or oligarchs, are factoring consequences in to their decisions. The only consequence they do fear is not getting their way.</p>\n\n<p>At one point you might have been able to say they these people are simply doing what they thinks is best for the United States and that there can be different approaches toward the same ends. I no longer believe this to be true, the ultimate motivation is staying in power and satisfying the people responsible for that power.</p>\n",
			"date_published": "2018-10-03T11:13:04-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/from-the-republicans.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/03/dave-is-developing.html",
	      	
			"content_html": "<p><a href=\"http://scripting.com/2018/10/02.html#a021728\">Dave is developing another iteration</a> of his blogging tools, this time using Github for the storage.</p>\n",
			"date_published": "2018-10-03T11:03:48-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/dave-is-developing.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/03/this-in-the.html",
	      	
			"content_html": "<p><a href=\"https://www.nytimes.com/2018/09/30/us/migrant-children-tent-city-texas.html\">This</a>, in the United States of America.</p>\n",
			"date_published": "2018-10-03T09:28:40-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/this-in-the.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/03/how-much-do.html",
	      	
			"content_html": "<p>How much do the Trump rallys cost the U.S. taxpayer? We are definitely paying for the secret service and police protection, what about the transportation and all other accommodations? You can say the same thing about every weekend trip to his golf courses and resorts.</p>\n",
			"date_published": "2018-10-03T09:22:50-04:00",
			"url": "https://frankmcpherson.blog/2018/10/03/how-much-do.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/02/the-big-disruption.html",
	      	
			"content_html": "<p><a href=\"https://medium.com/s/the-big-disruption/the-big-disruption-36fbed0268cf\">The Big Disruption: A Totally Fictional But Essentially True Silicon Valley Story</a></p>\n<blockquote>\n  <p>When Fred died of old age a few years later, all the employees gathered to pay their respects. During the dedication of a commemorative aquarium in the company’s main building, the founder of Anahata, a man named Bobby Bonilo, told his employees that it was Fred who had taught him how to run his company. Fred, he said, had proven that it was fine to have one eye and waddle if you were better than anyone else at doing those things.</p>\n</blockquote>\n",
			"date_published": "2018-10-02T10:51:11-04:00",
			"url": "https://frankmcpherson.blog/2018/10/02/the-big-disruption.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/02/foggy-but-not.html",
	      	
			"content_html": "<p>Foggy but not raining this morning, so there is that. Is today the Cubbies last game of the season?</p>\n",
			"date_published": "2018-10-02T09:17:49-04:00",
			"url": "https://frankmcpherson.blog/2018/10/02/foggy-but-not.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/02/the-game-went.html",
	      	
			"content_html": "<p>The game went pretty much as expected. You aren’t going to win games in which you only get three hits.</p>\n",
			"date_published": "2018-10-01T20:03:25-04:00",
			"url": "https://frankmcpherson.blog/2018/10/01/the-game-went.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/01/looking-back-it.html",
	      	
			"content_html": "<p>Looking back, it occurs to me that <a href=\"http://writing.frankmcpherson.org/2017/10/20/thereIsTeamInBaseball.html\">my analysis</a> of the Cub’s performance in last year’s playoffs might be applicable to this year too.</p>\n\n<p>The Cubs did make moves to address their bullpen, but the closer the signed, who pitched for the Dodgers last year, is not playing due to injury. The closer’s backup is also not playing due to injury and the result is that all the remaining arms in the pen are doing things unexpected of them.</p>\n",
			"date_published": "2018-10-01T11:57:36-04:00",
			"url": "https://frankmcpherson.blog/2018/10/01/looking-back-it.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/01/overtime-baseball.html",
	      	
			"title": "Overtime Baseball",
			
			"content_html": "<p>The Cubs and Brewers are playing game 163 starting at 1 PM EST to determine who wins the NL Central division and who will have the best record in the National League and with it home field advantage through the NL portion of the playoffs.</p>\n\n<p>On paper the game appears to come down to momentum versus experience. The Brewers have won seven straight to finish the season and force this game, while the Cubs have been in the playoffs the last three years and won the world series in 2016.</p>\n\n<p>For me the Cub’s chances to win the game weigh heavily on Quintana’s ability to keep Lorenzo Cain off the bases so that he can pitch around Yelich. Cub’s need to hit and score runs early as the Brewer’s bullpen is superior and this most likely will turn in to a bullpen game early. The Brewer’s bullpen enables them to follow the same formula as the Royals did when they had their playoff runs.</p>\n\n<p>Anxious to see how this turns out. While the Cubs at worse will end up with the second-best record in the NL, they go in to playoffs as the weakest team due to injury and the grind of playing on 40 of 41 days to end the season. In some ways this is a must win just to get a few days off, but I don’t think Maddon will manage in such a manner.</p>\n",
			"date_published": "2018-10-01T11:12:28-04:00",
			"url": "https://frankmcpherson.blog/2018/10/01/overtime-baseball.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/10/01/i-dont-know.html",
	      	
			"content_html": "<p>I don’t know <a href=\"http://scripting.com/2018/09/29/004408.html\">how we fix societal issues</a>. The society we live in so large with so many people needing to change, it just doesn’t seem possible.</p>\n\n<p>Take for example the Civil Rights movement. I bet some thought that surely we had that race thing behind us. Sure, there will always be bigots, but it’s not so entrenched in the fabric of society any more, is it?</p>\n\n<p>What we have learned in the last two years is no, society really hasn’t changed much since the 60s, white people just pat themselves for the appearance.</p>\n",
			"date_published": "2018-10-01T09:37:22-04:00",
			"url": "https://frankmcpherson.blog/2018/10/01/i-dont-know.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/just-discovered-the.html",
	      	
			"content_html": "<p>Just discovered the iOS 12 space bar / touchpad function to move the cursor. Very cool.</p>\n",
			"date_published": "2018-09-28T16:56:54-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/just-discovered-the.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/wear-os-update.html",
	      	
			"content_html": "<p><a href=\"https://www.slashgear.com/wear-os-update-how-to-download-install-info-28548073/\">Wear OS update today: 5 reasons to be excited - SlashGear</a></p>\n\n<p>Awaiting the update for my Fossil Q Explorist.</p>\n",
			"date_published": "2018-09-28T16:08:26-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/wear-os-update.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/liberals-who-are.html",
	      	
			"content_html": "<p>Liberals who are angry about the pending appointment to the Supreme Court need to remember, they could have avoided this if they had voted for Hilary.</p>\n",
			"date_published": "2018-09-28T15:28:20-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/liberals-who-are.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/they-liked-his.html",
	      	
			"title": "They Liked His Anger",
			
			"content_html": "<p>The Senate Judiciary Committee’s recommendation for a full vote on Kavanaugh demonstrates the value of diversity. All the Republicans on the committee are men who identified with Kavanaugh’s anger. Lindsey Graham seemed to channel it the most. In that moment it no longer mattered whether Kavanaugh is qualified for the job (I don’t think he is) or guilty of sexual assault because by god they like the man just because he got pissed off! And that too is how we end up with Trump as President because enough voters liked him and didn’t care about his ability to actually do the job.</p>\n\n<p>Senators have a constitutional responsibility to determine whether a person is competent to be a Supreme Court justice and not just like the candidates. The Senators who supported Kavanaugh have failed their duty.</p>\n",
			"date_published": "2018-09-28T15:26:41-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/they-liked-his.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/i-love-september.html",
	      	
			"content_html": "<p>I love September baseball.</p>\n",
			"date_published": "2018-09-28T15:03:24-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/i-love-september.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/of-the-mail.html",
	      	
			"content_html": "<p>Of the mail apps that I’ve seen so far, <a href=\"https://sparkmailapp.com/\">Spark</a> might be the closest to providing the functionality of Google Inbox. If/when it releases for Android and web it may be a full replacement.</p>\n",
			"date_published": "2018-09-28T12:13:39-04:00",
			"url": "https://frankmcpherson.blog/2018/09/28/of-the-mail.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/brett-kavanaugh-and.html",
	      	
			"content_html": "<p><a href=\"https://www.newyorker.com/news/current/brett-kavanaughs-adolescent-temper-tantrum-before-the-senate-judiciary-committee\">Brett Kavanaugh and the Adolescent Aggression of Conservative Masculinity</a></p>\n\n<p>To Republicans complaining about partisanship I simply ask what is possibility more partisan than not even having a hearing on a SCOTUS nominee simply because the president is a Democrat? You have no integrity to make any such complaint.</p>\n",
			"date_published": "2018-09-27T22:22:36-04:00",
			"url": "https://frankmcpherson.blog/2018/09/27/brett-kavanaugh-and.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/the-pervasive-belief.html",
	      	
			"content_html": "<p>The pervasive belief that girls and women just make stuff up about sexual assult is what enables it to happen in the first place. It’s a belief perpetuated by boys and men to maintain their power. What is occuring right now is men in power maintaining their power. It’s not about right or wrong. It’s not about democracy or governing, it’s all about privilege and power and getting what one wants.</p>\n\n<p>And what you see on your TV screen, that’s a reflection of yourself. The problem isn’t that it’s happening, the problem is that you are ok with it.</p>\n",
			"date_published": "2018-09-27T21:59:59-04:00",
			"url": "https://frankmcpherson.blog/2018/09/27/the-pervasive-belief.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/28/i-clearly-started.html",
	      	
			"content_html": "<p>I clearly started the wrong Rams receiver.</p>\n",
			"date_published": "2018-09-27T21:43:25-04:00",
			"url": "https://frankmcpherson.blog/2018/09/27/i-clearly-started.html"
		},
		
		{
			"id": "http://frankm.micro.blog/2018/09/27/every-android-version.html",
	      	
			"content_html": "<p><a href=\"https://www.cnet.com/news/every-android-version-from-the-t-mobile-g1-to-android-pie/\">Every Android version from the T-Mobile G1 to Android Pie - CNET</a></p>\n\n<p>This article provided a nice overview of all the features that have been added to Android over the years.</p>\n",
			"date_published": "2018-09-26T22:58:18-04:00",
			"url": "https://frankmcpherson.blog/2018/09/26/every-android-version.html"
		}
		
	]
}
